XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Peripheral/ch32v4x7_gpio.c
        case 0x46710001: /*CH32V407WEU*/
        {
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6|GPIO_Pin_7|GPIO_Pin_8\
                                         |GPIO_Pin_9;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
            GPIO_Init(GPIOC, &GPIO_InitStructure);
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3\
                                         |GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_6\
                                         |GPIO_Pin_7|GPIO_Pin_9|GPIO_Pin_10\
                                         |GPIO_Pin_11|GPIO_Pin_12|GPIO_Pin_13\
                                         |GPIO_Pin_14|GPIO_Pin_15;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
            GPIO_Init(GPIOD, &GPIO_InitStructure);
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2|GPIO_Pin_3|GPIO_Pin_4\
                                         |GPIO_Pin_5|GPIO_Pin_6|GPIO_Pin_7;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
            GPIO_Init(GPIOE, &GPIO_InitStructure);
            break;
        }

        case  0x46740001: /*CH32V467WEU*/
        {
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6|GPIO_Pin_7|GPIO_Pin_8\
                                         |GPIO_Pin_9;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
            GPIO_Init(GPIOC, &GPIO_InitStructure);
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3\
                                         |GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_6\
                                         |GPIO_Pin_7|GPIO_Pin_8|GPIO_Pin_9\
                                         |GPIO_Pin_10|GPIO_Pin_11|GPIO_Pin_12\
                                         |GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
            GPIO_Init(GPIOD, &GPIO_InitStructure);
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2|GPIO_Pin_3|GPIO_Pin_4\
                                         |GPIO_Pin_5|GPIO_Pin_6|GPIO_Pin_7;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
            GPIO_Init(GPIOE, &GPIO_InitStructure);
            break;
        }

        case  0x46730000: /*CH32V467VET*/
        {
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
            GPIO_Init(GPIOE, &GPIO_InitStructure);
            break;
        }

        case  0x46700000: /*CH32V407VET*/
        {
            break;
        }
        
        default:
        {
            break;
        }
        
    }
}
